# FarDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..FarDistance Property
CameraInfo Class See Also
---
Distance from eye point to far plane of view frustum along the view direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double FarDistance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FarDistance As Double
	Get
```

Visual C++
---
```text
public:
property double FarDistance {
	double get ();
}
```

# Remarks
This property together with NearDistance determines the depth restrictions of a view frustum.
# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace